In [44]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [45]:
%sql sqlite:///memory

In [46]:
%%sql
CREATE TABLE customers(
  customer_id INT PRIMARY KEY,
  first_name VARCHAR(100),
  last_name VARCHAR(100),
  email VARCHAR(100)
);

 * sqlite:///memory
(sqlite3.OperationalError) table customers already exists
[SQL: CREATE TABLE customers(
  customer_id INT PRIMARY KEY,
  first_name VARCHAR(100),
  last_name VARCHAR(100),
  email VARCHAR(100)
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [47]:
%sql SELECT * FROM customers;

 * sqlite:///memory
Done.

[(1, 'John', 'Doe', 'johndoe@email.com'),
 (2, 'Jane', 'Smith', 'janesmith@email.com'),
 (3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
 (4, 'Alice', 'Brown', 'alicebrown@email.com'),
 (5, 'Chalie', 'Davis', 'charliedavis@email.com'),
 (6, 'Eva', 'Fisher', 'evafisher@email.com'),
 (7, 'George', 'Harris', 'georgeharris@emial.com'),
 (8, 'Ivy', 'Jones', 'ivyjones@email.com'),
 (9, 'Kevin', 'Miller', 'kevinmiller@email.com'),
 (10, 'Lily', 'Nelson', 'lilynelson@email.com'),
 (11, 'Oliver', 'Patterson', 'oliverpatterson'),
 (12, 'Quinn', 'Roberts', 'quinnroberts@email.com'),
 (13, 'Sophia', 'Thomas', 'sophiathomas@email.com')]

In [48]:
%%sql
CREATE TABLE products(
  product_id INT PRIMARY KEY,
  product_name VARCHAR(100),
  order_data DATE(100)
);

 * sqlite:///memory
(sqlite3.OperationalError) table products already exists
[SQL: CREATE TABLE products(
  product_id INT PRIMARY KEY,
  product_name VARCHAR(100),
  order_data DATE(100)
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [49]:
%%sql DROP TABLE products;

 * sqlite:///memory
Done.

[]

In [50]:
%%sql
CREATE TABLE products(
  product_id INT PRIMARY KEY,
  product_name VARCHAR(100),
  price DECIMAL(4, 2)
);

 * sqlite:///memory
Done.

[]

In [51]:
%%sql
CREATE TABLE orders(
  order_id INT PRIMARY KEY,
  customer_id INT,
  order_date DATE
);

 * sqlite:///memory
(sqlite3.OperationalError) table orders already exists
[SQL: CREATE TABLE orders(
  order_id INT PRIMARY KEY,
  customer_id INT,
  order_date DATE
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [67]:
%%sql
CREATE TABLE order_items(
  order_id INT PRIMARY KEY,
  product_id INT,
  quantity INT
);

 * sqlite:///memory
Done.

[]

In [ ]:
%%sql
INSERT INTO customers(customer_id, first_name, last_name, email) VALUES
(1, 'John', 'Doe', 'johndoe@email.com'),
(2, 'Jane', 'Smith', 'janesmith@email.com'),
(3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
(4, 'Alice', 'Brown', 'alicebrown@email.com'),
(5, 'Chalie', 'Davis', 'charliedavis@email.com'),
(6, 'Eva', 'Fisher', 'evafisher@email.com'),
(7, 'George', 'Harris', 'georgeharris@emial.com'),
(8, 'Ivy', 'Jones', 'ivyjones@email.com'),
(9, 'Kevin', 'Miller', 'kevinmiller@email.com'),
(10, 'Lily', 'Nelson', 'lilynelson@email.com'),
(11, 'Oliver', 'Patterson', 'oliverpatterson'),
(12, 'Quinn', 'Roberts', 'quinnroberts@email.com'),
(13, 'Sophia', 'Thomas', 'sophiathomas@email.com');

In [60]:
%sql SELECT * FROM customers;

 * sqlite:///memory
Done.

[(1, 'John', 'Doe', 'johndoe@email.com'),
 (2, 'Jane', 'Smith', 'janesmith@email.com'),
 (3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
 (4, 'Alice', 'Brown', 'alicebrown@email.com'),
 (5, 'Chalie', 'Davis', 'charliedavis@email.com'),
 (6, 'Eva', 'Fisher', 'evafisher@email.com'),
 (7, 'George', 'Harris', 'georgeharris@emial.com'),
 (8, 'Ivy', 'Jones', 'ivyjones@email.com'),
 (9, 'Kevin', 'Miller', 'kevinmiller@email.com'),
 (10, 'Lily', 'Nelson', 'lilynelson@email.com'),
 (11, 'Oliver', 'Patterson', 'oliverpatterson'),
 (12, 'Quinn', 'Roberts', 'quinnroberts@email.com'),
 (13, 'Sophia', 'Thomas', 'sophiathomas@email.com')]

In [54]:
%%sql
INSERT INTO products (product_id, product_name, price) VALUES
(1, 'Product A', 10.00),
(2, 'Product B', 15.00),
(3, 'Product C', 20.00),
(4, 'Product D', 25.00),
(5, 'Product E', 30.00),
(6, 'Product F', 35.00),
(7, 'Product G', 40.00),
(8, 'Product H', 45.00),
(9, 'Product I', 50.00),
(10, 'Product J', 55.00),
(11, 'Product K', 60.00),
(12, 'Product L', 65.00),
(13, 'Product M', 70.00);

 * sqlite:///memory
13 rows affected.

[]

In [59]:
%%sql SELECT * FROM products;

 * sqlite:///memory
Done.

[(1, 'Product A', 10),
 (2, 'Product B', 15),
 (3, 'Product C', 20),
 (4, 'Product D', 25),
 (5, 'Product E', 30),
 (6, 'Product F', 35),
 (7, 'Product G', 40),
 (8, 'Product H', 45),
 (9, 'Product I', 50),
 (10, 'Product J', 55),
 (11, 'Product K', 60),
 (12, 'Product L', 65),
 (13, 'Product M', 70)]

In [ ]:
%%sql
INSERT INTO orders (order_id, customer_id, order_date) VALUES
(1, 1, '2023-05-01'),
(2, 2, '2023-05-02'),
(3, 3, '2023-05-03'),
(4, 1, '2023-05-04'),
(5, 2, '2023-05-05'),
(6, 3, '2023-05-06'),
(7, 4, '2023-05-07'),
(8, 5, '2023-05-08'),
(9, 6, '2023-05-09'),
(10, 7, '2023-05-10'),
(11, 8, '2023-05-11'),
(12, 9, '2023-05-12'),
(13, 10, '2023-05-13'),
(14, 11, '2023-05-14'),
(15, 12, '2023-05-15'),
(16, 13, '2023-05-16');

In [58]:
%%sql SELECT * FROM orders;

 * sqlite:///memory
Done.

[(1, 1, '2023-05-01'),
 (2, 2, '2023-05-02'),
 (3, 3, '2023-05-03'),
 (4, 1, '2023-05-04'),
 (5, 2, '2023-05-05'),
 (6, 3, '2023-05-06'),
 (7, 4, '2023-05-07'),
 (8, 5, '2023-05-08'),
 (9, 6, '2023-05-09'),
 (10, 7, '2023-05-10'),
 (11, 8, '2023-05-11'),
 (12, 9, '2023-05-12'),
 (13, 10, '2023-05-13'),
 (14, 11, '2023-05-14'),
 (15, 12, '2023-05-15'),
 (16, 13, '2023-05-16')]

In [69]:
%%sql
INSERT INTO order_items (order_id, product_id, quantity) VALUES
(1, 1, 2),
(2, 2, 1),
(3, 2, 1),
(4, 3, 3),
(5, 1, 1),
(6, 3, 2),
(7, 2, 4),
(8, 3, 1),
(9, 1, 1),
(10, 3, 2),
(11, 2, 3),
(12, 1, 1),
(13, 4, 1),
(14, 5, 2),
(15, 6, 3),
(16, 7, 1),
(17, 8, 2),
(18, 9, 1),
(19, 10, 3),
(20, 11, 2),
(21, 12, 1),
(22, 13, 3),
(23, 4, 2),
(24, 5, 1),
(25, 6, 3),
(26, 7, 2),
(27, 8, 1),
(28, 9, 2),
(29, 10, 3),
(30, 11, 1),
(31, 12, 2),
(32, 13, 3);

 * sqlite:///memory
32 rows affected.

[]

In [70]:
%sql SELECT * FROM order_items;

 * sqlite:///memory
Done.

[(1, 1, 2),
 (2, 2, 1),
 (3, 2, 1),
 (4, 3, 3),
 (5, 1, 1),
 (6, 3, 2),
 (7, 2, 4),
 (8, 3, 1),
 (9, 1, 1),
 (10, 3, 2),
 (11, 2, 3),
 (12, 1, 1),
 (13, 4, 1),
 (14, 5, 2),
 (15, 6, 3),
 (16, 7, 1),
 (17, 8, 2),
 (18, 9, 1),
 (19, 10, 3),
 (20, 11, 2),
 (21, 12, 1),
 (22, 13, 3),
 (23, 4, 2),
 (24, 5, 1),
 (25, 6, 3),
 (26, 7, 2),
 (27, 8, 1),
 (28, 9, 2),
 (29, 10, 3),
 (30, 11, 1),
 (31, 12, 2),
 (32, 13, 3)]